In [2]:
import numpy as np
import pandas as pd

# df.groupby(分组依据)[数据来源].使用操作

In [3]:
df = pd.read_csv("./data/learn_pandas.csv")

In [4]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

## 各校平均身高

In [5]:
df.groupby("School")["Height"].mean()

School
Fudan University                 162.408824
Peking University                162.977419
Shanghai Jiao Tong University    163.932727
Tsinghua University              163.149206
Name: Height, dtype: float64

## 各校 男女的平均体重

In [6]:
df.groupby(["School","Gender"])["Weight"].mean()

School                         Gender
Fudan University               Female    47.900000
                               Male      72.300000
Peking University              Female    46.650000
                               Male      73.700000
Shanghai Jiao Tong University  Female    48.513514
                               Male      76.000000
Tsinghua University            Female    48.000000
                               Male      69.947368
Name: Weight, dtype: float64

## condition for groupby

In [7]:
condition = df.Weight >= df.Weight.median()

In [8]:
condition

0      False
1       True
2       True
3      False
4       True
       ...
195    False
196    False
197    False
198     True
199     True
Name: Weight, Length: 200, dtype: bool

In [10]:
df.groupby(condition)["Height"].median()

Weight
False    157.15
True     167.00
Name: Height, dtype: float64

### 体重不超过中位数的一组，身高中位数157， 体重超过中位数的另一组，身高中位数167.

# Groupby 对象

In [11]:
gb = df.groupby(["School","Grade"])

In [12]:
gb.ngroups

16

In [15]:
results = gb.groups
results.keys()

dict_keys([('Fudan University', 'Freshman'), ('Fudan University', 'Junior'), ('Fudan University', 'Senior'), ('Fudan University', 'Sophomore'), ('Peking University', 'Freshman'), ('Peking University', 'Junior'), ('Peking University', 'Senior'), ('Peking University', 'Sophomore'), ('Shanghai Jiao Tong University', 'Freshman'), ('Shanghai Jiao Tong University', 'Junior'), ('Shanghai Jiao Tong University', 'Senior'), ('Shanghai Jiao Tong University', 'Sophomore'), ('Tsinghua University', 'Freshman'), ('Tsinghua University', 'Junior'), ('Tsinghua University', 'Senior'), ('Tsinghua University', 'Sophomore')])

In [17]:
gb.size()

School                         Grade
Fudan University               Freshman      9
                               Junior       12
                               Senior       11
                               Sophomore     8
Peking University              Freshman     13
                               Junior        8
                               Senior        8
                               Sophomore     5
Shanghai Jiao Tong University  Freshman     13
                               Junior       17
                               Senior       22
                               Sophomore     5
Tsinghua University            Freshman     17
                               Junior       22
                               Senior       14
                               Sophomore    16
dtype: int64

In [21]:
gb.get_group(("Fudan University","Senior"))

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
39,Fudan University,Senior,Chengpeng Zheng,Female,151.7,38.0,N,2,2019/11/1,0:03:39
46,Fudan University,Senior,Feng Zhou,Female,155.6,47.0,N,2,2019/11/18,0:04:59
49,Fudan University,Senior,Gaomei Lv,Female,147.3,34.0,N,2,2019/10/16,0:03:44
52,Fudan University,Senior,Chunli Lv,Female,166.7,56.0,N,2,2019/11/12,0:03:53
66,Fudan University,Senior,Chengpeng Zhou,Male,177.1,81.0,N,1,2019/9/5,0:03:38
77,Fudan University,Senior,Gaopeng Qin,Female,159.4,52.0,N,3,2019/9/28,0:05:15
112,Fudan University,Senior,Chunjuan Xu,Female,159.8,47.0,N,1,2019/10/18,0:05:03
129,Fudan University,Senior,Juan Zhang,Female,159.9,47.0,N,2,2019/11/11,0:03:34
131,Fudan University,Senior,Chengpeng Qian,Male,177.2,73.0,Y,1,2019/12/19,0:05:18
138,Fudan University,Senior,Xiaojuan Qian,Female,160.6,50.0,N,1,2020/1/1,0:04:45
144,Fudan University,Senior,Quan Xu,Female,157.0,44.0,N,2,2019/11/7,0:03:44

# 聚合函数 Aggregation

In [22]:
gb= df.groupby("Gender")["Weight"]

In [23]:
gb.mean()

Gender
Female    47.918519
Male      72.759259
Name: Weight, dtype: float64

In [24]:
gb.idxmax()

Gender
Female    28
Male       2
Name: Weight, dtype: int64

In [25]:
gb.idxmin()

Gender
Female     49
Male      199
Name: Weight, dtype: int64

# quantile 百分位

In [26]:
gb.quantile([0.25,0.5,0.75])

Gender
Female  0.25    44.00
        0.50    48.00
        0.75    52.00
Male    0.25    69.00
        0.50    73.00
        0.75    78.75
Name: Weight, dtype: float64

# 分组后，接受多个来源数据

In [28]:
gb = df.groupby(["School","Gender"])[["Height","Weight"]]

In [29]:
gb.max()

                                      Height  Weight
School                        Gender
Fudan University              Female   170.2    63.0
                              Male     177.3    81.0
Peking University             Female   170.0    56.0
                              Male     185.3    87.0
Shanghai Jiao Tong University Female   167.7    57.0
                              Male     188.9    89.0
Tsinghua University           Female   168.9    57.0
                              Male     193.9    79.0

# agg 方法

##  使用多个函数

In [30]:
gb.agg(["min","max","median"])

                                     Height                Weight
                                        min    max  median    min   max median
School                        Gender
Fudan University              Female  147.3  170.2  159.10   34.0  63.0   47.5
                              Male    167.6  177.3  175.95   62.0  81.0   73.5
Peking University             Female  147.8  170.0  159.90   34.0  56.0   46.5
                              Male    162.4  185.3  171.00   58.0  87.0   73.5
Shanghai Jiao Tong University Female  145.4  167.7  159.15   34.0  57.0   49.0
                              Male    166.0  188.9  176.40   62.0  89.0   75.0
Tsinghua University           Female  150.5  168.9  160.70   36.0  57.0   49.0
                              Male    155.7  193.9  170.40   51.0  79.0   71.0

## 对特定的列使用特定的聚合函数

In [31]:
gb.agg({"Height":["min","median","max"],"Weight":["mean","idxmin","idxmax"]})

                                     Height                    Weight         \
                                        min  median    max       mean idxmin
School                        Gender
Fudan University              Female  147.3  159.10  170.2  47.900000     49
                              Male    167.6  175.95  177.3  72.300000    152
Peking University             Female  147.8  159.90  170.0  46.650000    120
                              Male    162.4  171.00  185.3  73.700000     54
Shanghai Jiao Tong University Female  145.4  159.15  167.7  48.513514    143
                              Male    166.0  176.40  188.9  76.000000     21
Tsinghua University           Female  150.5  160.70  168.9  48.000000    139
                              Male    155.7  170.40  193.9  69.947368    199


                                     idxmax
School                        Gender
Fudan University              Female     28
                              Male       66
Peking University             Female     75
                              Male       38
Shanghai Jiao Tong University Female     64
                              Male        2
Tsinghua University           Female     14
                              Male       40

## 使用自定义函数

In [32]:
gb.agg(lambda x : x.max()-x.min())

                                      Height  Weight
School                        Gender
Fudan University              Female    22.9    29.0
                              Male       9.7    19.0
Peking University             Female    22.2    22.0
                              Male      22.9    29.0
Shanghai Jiao Tong University Female    22.3    23.0
                              Male      22.9    27.0
Tsinghua University           Female    18.4    21.0
                              Male      38.2    28.0

## 聚合结果重命名

In [34]:
gb.agg([("Peak to Peak", lambda x: x.max()-x.min()),("Standard Deviation", "std"),("Vardiance","var")])

                                           Height                     \
                                     Peak to Peak Standard Deviation
School                        Gender
Fudan University              Female         22.9           5.536086
                              Male            9.7           3.934259
Peking University             Female         22.2           6.107318
                              Male           22.9           7.132562
Shanghai Jiao Tong University Female         22.3           4.901464
                              Male           22.9           6.929317
Tsinghua University           Female         18.4           4.452558
                              Male           38.2           7.665825

                                                      Weight  \
                                      Vardiance Peak to Peak
School                        Gender
Fudan University              Female  30.648246         29.0
                              Male    15.478393         19.0
Peking University             Female  37.299333         22.0
                              Male    50.873444         29.0
Shanghai Jiao Tong University Female  24.024353         23.0
                              Male    48.015429         27.0
Tsinghua University           Female  19.825273         21.0
                              Male    58.764869         28.0


                                     Standard Deviation  Vardiance
School                        Gender
Fudan University              Female           6.098898  37.196552
                              Male             6.092801  37.122222
Peking University             Female           5.769931  33.292105
                              Male             8.667308  75.122222
Shanghai Jiao Tong University Female           4.764578  22.701201
                              Male             8.124038  66.000000
Tsinghua University           Female           5.343519  28.553191
                              Male             7.260806  52.719298

# 变换函数 与transform 方法。

In [39]:
gb.cummax()

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    41.0
4     174.0    74.0
..      ...     ...
195   170.2    63.0
196   168.9    57.0
197   167.7    57.0
198   188.9    89.0
199   193.9    79.0

[200 rows x 2 columns]

### 把每位同学的身高体重替换成所在组的最小值。

In [40]:
gb.transform(lambda x: x.min())

     Height  Weight
0     145.4    34.0
1     162.4    58.0
2     166.0    62.0
3     147.3    34.0
4     167.6    62.0
..      ...     ...
195   147.3    34.0
196   150.5    36.0
197   145.4    34.0
198   166.0    62.0
199   155.7    51.0

[200 rows x 2 columns]

### 把每位同学的身高体重替换成所在组的平均值。

In [41]:
gb.transform(lambda x: x.mean())

         Height     Weight
0    159.122500  48.513514
1    172.030000  73.700000
2    176.760000  76.000000
3    158.776923  47.900000
4    174.212500  72.300000
..          ...        ...
195  158.776923  47.900000
196  159.753333  48.000000
197  159.122500  48.513514
198  176.760000  76.000000
199  171.638889  69.947368

[200 rows x 2 columns]

# 组索引过滤

In [48]:
gb.filter(lambda x: x.shape[0]>45)

     Height  Weight
5     158.0    51.0
7     161.9    50.0
8     163.0    48.0
11    153.2    43.0
14    165.3    57.0
25    156.5    42.0
27    163.1    53.0
33    163.7    49.0
34    164.3    51.0
43    157.4    46.0
44    162.3    51.0
47    162.5    53.0
51    161.3    47.0
53    164.1    57.0
55    168.9    54.0
62    156.5    43.0
67    156.8    42.0
69    162.1    54.0
78    161.5    53.0
80    150.5    40.0
81    165.1    52.0
92    161.2    47.0
97    160.8    54.0
100   164.4    55.0
106   154.3    40.0
110   157.9    47.0
111     NaN    52.0
113   159.6    49.0
118   160.6    47.0
125   151.8    38.0
126   154.0    40.0
128   158.5    45.0
133     NaN    41.0
136   155.2    44.0
137   160.8    51.0
139   150.5    36.0
142   158.9    44.0
146   168.6    55.0
151   156.4    43.0
154     NaN    44.0
163   158.0    51.0
168   155.7    47.0
169   160.7    52.0
175   154.2    41.0
176   160.2    51.0
180   161.1    50.0
191   166.6    54.0
196   160.9    50.0

In [60]:
gb.filter(lambda x : x.shape[0]>47)

     Height  Weight
5     158.0    51.0
7     161.9    50.0
8     163.0    48.0
11    153.2    43.0
14    165.3    57.0
25    156.5    42.0
27    163.1    53.0
33    163.7    49.0
34    164.3    51.0
43    157.4    46.0
44    162.3    51.0
47    162.5    53.0
51    161.3    47.0
53    164.1    57.0
55    168.9    54.0
62    156.5    43.0
67    156.8    42.0
69    162.1    54.0
78    161.5    53.0
80    150.5    40.0
81    165.1    52.0
92    161.2    47.0
97    160.8    54.0
100   164.4    55.0
106   154.3    40.0
110   157.9    47.0
111     NaN    52.0
113   159.6    49.0
118   160.6    47.0
125   151.8    38.0
126   154.0    40.0
128   158.5    45.0
133     NaN    41.0
136   155.2    44.0
137   160.8    51.0
139   150.5    36.0
142   158.9    44.0
146   168.6    55.0
151   156.4    43.0
154     NaN    44.0
163   158.0    51.0
168   155.7    47.0
169   160.7    52.0
175   154.2    41.0
176   160.2    51.0
180   161.1    50.0
191   166.6    54.0
196   160.9    50.0

# 以上保留下来的事分组后，组员属大于47的。

In [66]:
gb.size()

School                         Gender
Fudan University               Female    30
                               Male      10
Peking University              Female    22
                               Male      12
Shanghai Jiao Tong University  Female    41
                               Male      16
Tsinghua University            Female    48
                               Male      21
dtype: int64

# 跨列分组 apply

In [67]:
def BMI(x):
    Height = x['Height']/100
    Weight = x['Weight']
    BMI_value = Weight/Height**2
    return BMI_value.mean()
gb.apply(BMI)

School                         Gender
Fudan University               Female    18.891092
                               Male      24.401886
Peking University              Female    18.473946
                               Male      24.629279
Shanghai Jiao Tong University  Female    19.106968
                               Male      24.522800
Tsinghua University            Female    18.810067
                               Male      23.946918
dtype: float64

In [72]:
gb = df.groupby("School")[["Height","Weight"]]

# 返回标量

In [74]:
gb.apply(lambda x: x.mean())

                                   Height     Weight
School
Fudan University               162.408824  54.000000
Peking University              162.977419  55.666667
Shanghai Jiao Tong University  163.932727  56.442308
Tsinghua University            163.149206  54.223881

In [76]:
gb.apply(lambda x: np.nan)

School
Fudan University                NaN
Peking University               NaN
Shanghai Jiao Tong University   NaN
Tsinghua University             NaN
dtype: float64

# 返回 Series

In [77]:
gb.apply(lambda x : pd.Series(data=x.mean(),index=["Height","Weight"],name="A series"))

A series                           Height     Weight
School
Fudan University               162.408824  54.000000
Peking University              162.977419  55.666667
Shanghai Jiao Tong University  163.932727  56.442308
Tsinghua University            163.149206  54.223881

In [82]:
gb.apply(lambda x : pd.Series(data=x.mean(),name="A series"))

A series                           Height     Weight
School
Fudan University               162.408824  54.000000
Peking University              162.977419  55.666667
Shanghai Jiao Tong University  163.932727  56.442308
Tsinghua University            163.149206  54.223881

# 返回 dataframe

In [81]:
gb.apply(lambda x: pd.DataFrame(data=x.min(), columns=["Min Value"]))

                                      Min Value
School
Fudan University              Height      147.3
                              Weight       34.0
Peking University             Height      147.8
                              Weight       34.0
Shanghai Jiao Tong University Height      145.4
                              Weight       34.0
Tsinghua University           Height      150.5
                              Weight       36.0